Данный репозиторий создан под выполнение задач по итоговой атестации первой четверти.
Тут представлен файл, который выполняет задачу: "Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами".
Код представляет собой форму создания пустого массива, который представлен в виде: string [] M;
после чего идёт Console.Writline, внутри написана фраза, которую встречает пользователь в ковычках: "Введите массив строк через запятую".
Дальше идёт объявление стринг строка, которая представляет собой введение пользователем любой комбинации текста для дальнейшей корректировки через M = stroka.Split(',');
после чего создаются две формы: 
var result = new string[M.Length];
var realSize = 0;
var result представляет собой длину массива
а var realSize размер, который заранее задан числом 0.
После этого начинается перебор текста с условием:
foreach (var value in M) {
    if (value.Length <= 3) {
        result[realSize] = value;
        realSize++;
    }
}
и в конце вывод:
Console.WriteLine(string.Join(Environment.NewLine, result, 0, realSize));
Console.ReadKey(true); .